package cc.topicexplorer.plugin.mecab.preprocessing.command;

import java.sql.SQLException;
import java.util.Set;

import org.apache.log4j.Logger;

import com.google.common.collect.Sets;

import cc.topicexplorer.commands.TableFillCommand;

public class PosTypeFill extends TableFillCommand {
	private static final Logger logger = Logger.getLogger(PosTypeFill.class);

	@Override
	public Set<String> getAfterDependencies() {
		return Sets.newHashSet();
	}

	@Override
	public Set<String> getBeforeDependencies() {
		return Sets.newHashSet("PosTypeCreate");
	}

	@Override
	public Set<String> getOptionalAfterDependencies() {
		return Sets.newHashSet();
	}

	@Override
	public Set<String> getOptionalBeforeDependencies() {
		return Sets.newHashSet();
	}

	@Override
	public void fillTable() {
		try {
			this.database.executeUpdateQuery("INSERT INTO " + this.tableName
					+ " (`POS`, `LOW`, `HIGH`, `DESCRIPTION`, `PARENT_POS`) VALUES "
					+ "(0, 1000, 1999, '間投', 100),"
					+ "(1, 2000, 2999, 'フィラー', NULL),"
					+ "(2, 3000, 3999, '感動詞', NULL),"
					+ "(3, 5000, 5999, 'アルファベット', 101),"
					+ "(4, 6000, 6999, '一般', 101),"
					+ "(5, 7000, 7999, '括弧開', 101),"
					+ "(6, 8000, 8999, '括弧閉', 101),"
					+ "(7, 9000, 9999, '句点', 101),"
					+ "(8, 10000, 10999, '空白', 101),"
					+ "(9, 11000, 11999, '読点', 101),"
					+ "(10, 13000, 13999, '自立', 102),"
					+ "(11, 14000, 14999, '接尾', 102),"
					+ "(12, 15000, 15999, '非自立', 102),"
					+ "(13, 18000, 18999, '一般', 104),"
					+ "(14, 19000, 19999, '引用', 104),"
					+ "(15, 20000, 20999, '連語', 104),"
					+ "(16, 21000, 21999, '係助詞', 103),"
					+ "(17, 22000, 22999, '終助詞', 103),"
					+ "(18, 23000, 23999, '接続助詞', 103),"
					+ "(19, 24000, 24999, '特殊', 103),"
					+ "(20, 25000, 25999, '副詞化', 103),"
					+ "(21, 26000, 26999, '副助詞', 103),"
					+ "(22, 27000, 27999, '副助詞／並立助詞／終助詞', 103),"
					+ "(23, 28000, 28999, '並立助詞', 103),"
					+ "(24, 29000, 29999, '連体化', 103),"
					+ "(25, 30000, 30999, '助動詞', NULL),"
					+ "(26, 31000, 31999, '接続詞', NULL),"
					+ "(27, 33000, 33999, '形容詞接続', 105),"
					+ "(28, 34000, 34999, '数接続', 105),"
					+ "(29, 35000, 35999, '動詞接続', 105),"
					+ "(30, 36000, 36999, '名詞接続', 105),"
					+ "(31, 38000, 38999, '自立', 106),"
					+ "(32, 39000, 39999, '接尾', 106),"
					+ "(33, 40000, 40999, '非自立', 106),"
					+ "(34, 42000, 42999, '一般', 107),"
					+ "(35, 43000, 43999, '助詞類接続', 107),"
					+ "(36, 45000, 45999, 'サ変接続', 108),"
					+ "(37, 46000, 46999, 'ナイ形容詞語幹', 108),"
					+ "(38, 47000, 47999, '一般', 108),"
					+ "(39, 48000, 48999, '引用文字列', 108),"
					+ "(40, 49000, 49999, '形容動詞語幹', 108),"
					+ "(41, 51000, 51999, '一般', 109),"
					+ "(42, 53000, 53999, '一般', 110),"
					+ "(43, 54000, 54999, '姓', 110),"
					+ "(44, 55000, 55999, '名', 110),"
					+ "(45, 56000, 56999, '組織', 109),"
					+ "(46, 58000, 58999, '一般', 111),"
					+ "(47, 59000, 59999, '国', 111),"
					+ "(48, 60000, 60999, '数', 108),"
					+ "(49, 61000, 61999, '接続詞的', 108),"
					+ "(50, 63000, 63999, 'サ変接続', 112),"
					+ "(51, 64000, 64999, '一般', 112),"
					+ "(52, 65000, 65999, '形容動詞語幹', 112),"
					+ "(53, 66000, 66999, '助数詞', 112),"
					+ "(54, 67000, 67999, '助動詞語幹', 112),"
					+ "(55, 68000, 68999, '人名', 112),"
					+ "(56, 69000, 69999, '地域', 112),"
					+ "(57, 70000, 70999, '特殊', 112),"
					+ "(58, 71000, 71999, '副詞可能', 112),"
					+ "(59, 73000, 73999, '一般', 113),"
					+ "(60, 74000, 74999, '縮約', 113),"
					+ "(61, 75000, 75999, '動詞非自立的', 108),"
					+ "(62, 77000, 77999, '助動詞語幹', 114),"
					+ "(63, 79000, 79999, '一般', 115),"
					+ "(64, 80000, 80999, '形容動詞語幹', 115),"
					+ "(65, 81000, 81999, '助動詞語幹', 115),"
					+ "(66, 82000, 82999, '副詞可能', 115),"
					+ "(67, 83000, 83999, '副詞可能', 108),"
					+ "(68, 84000, 84999, '連体詞', NULL),"
					+ "(100, 0, 1999, 'その他', NULL),"
					+ "(101, 4000, 11999, '記号', NULL),"
					+ "(102, 12000, 15999, '形容詞', NULL),"
					+ "(103, 16000, 29999, '助詞', NULL),"
					+ "(104, 17000, 20999, '格助詞', 103),"
					+ "(105, 32000, 36999, '接頭詞', NULL),"
					+ "(106, 37000, 40999, '動詞', NULL),"
					+ "(107, 41000, 43999, '副詞', NULL),"
					+ "(108, 44000, 83999, '名詞', NULL),"
					+ "(109, 50000, 59999, '固有名詞', 108),"
					+ "(110, 52000, 55999, '人名', 109),"
					+ "(111, 57000, 59999, '地域', 109),"
					+ "(112, 62000, 71999, '接尾', 108),"
					+ "(113, 72000, 74999, '代名詞', 108),"
					+ "(114, 76000, 77999, '特殊', 108),"
					+ "(115, 78000, 82999, '非自立', 108)");
		} catch (SQLException e) {
			logger.error("Table " + this.tableName + " could not be filled.");
			throw new RuntimeException(e);
		}
		
	}

	@Override
	public void setTableName() {
		this.tableName = "POS_TYPE";
	}

}
